In [1]:
import sqlite3
import pandas as pd
conn = sqlite3.connect(r'./example.db')
def ppsql(q):
    return pd.read_sql_query(q,sqlite3.connect(r'./example.db'))

In [2]:
ppsql("select sum(duration) as total_duration from films ")

   total_duration
0        534882.0

In [3]:
ppsql("select avg(duration) as avg_duration from films ")

   avg_duration
0    107.947931

In [5]:
ppsql("""-- Find the latest release_year
select max(release_year) as latest_year from films;""")

   latest_year
0       2016.0

In [6]:
ppsql("select min(duration) as min_duration from films ")

   min_duration
0           7.0

In [7]:
ppsql("""-- Calculate the sum of gross from the year 2000 or later
select sum(gross) as total_gross from films where release_year >=2000;""")

    total_gross
0  1.509009e+11

In [8]:
ppsql("""-- Calculate the average gross of films that start with A
select avg(gross) as avg_gross_A from films where title like 'A%'""")

    avg_gross_A
0  4.789324e+07

In [9]:
ppsql("""-- Calculate the highest gross film released between 2000-2012
select max(gross) as highest_gross from films where release_year between 2000 and 2012;""")

   highest_gross
0    760505847.0

In [10]:
ppsql("""-- Calculate the lowest gross film in 1994
select min(gross) as lowest_gross from films where release_year = 1994;""")

   lowest_gross
0      125169.0

In [11]:
ppsql("""-- Round the average number of facebook_likes to one decimal place
select round(avg(facebook_likes),1) as avg_facebook_likes from reviews;""")

   avg_facebook_likes
0              7802.9

In [12]:
ppsql("""-- Calculate the average budget rounded to the thousands
select round(avg(budget),-3) as avg_budget_thousands from films;""")

   avg_budget_thousands
0            39902826.0

In [13]:
ppsql("""-- Calculate the title and duration_hours from films
SELECT title, (duration/60.0) as duration_hours
FROM films;""")

                                                 title  duration_hours
0     Intolerance: Love's Struggle Throughout the Ages        2.050000
1                       Over the Hill to the Poorhouse        1.833333
2                                       The Big Parade        2.516667
3                                           Metropolis        2.416667
4                                        Pandora's Box        1.833333
...                                                ...             ...
4963                                       Unforgotten        0.750000
4964                                             Wings        0.500000
4965                                        Wolf Creek             NaN
4966                                 Wuthering Heights        2.366667
4967                           Yu-Gi-Oh! Duel Monsters        0.400000

[4968 rows x 2 columns]

In [14]:
ppsql("""-- Calculate the percentage of people who are no longer alive
SELECT count(deathdate) * 100.0 / count(*) AS percentage_dead
FROM people;""")

   percentage_dead
0         9.372395

In [15]:
ppsql("""-- Find the number of decades in the films table
SELECT (max(release_year)-min(release_year)) / 10.0 AS number_of_decades
FROM films;""")

   number_of_decades
0               10.0

In [16]:
ppsql("""-- Round duration_hours to two decimal places
SELECT title, round((duration / 60.0),2) AS duration_hours
FROM films;""")

                                                 title  duration_hours
0     Intolerance: Love's Struggle Throughout the Ages            2.05
1                       Over the Hill to the Poorhouse            1.83
2                                       The Big Parade            2.52
3                                           Metropolis            2.42
4                                        Pandora's Box            1.83
...                                                ...             ...
4963                                       Unforgotten            0.75
4964                                             Wings            0.50
4965                                        Wolf Creek             NaN
4966                                 Wuthering Heights            2.37
4967                           Yu-Gi-Oh! Duel Monsters            0.40

[4968 rows x 2 columns]